src/server/10.13/Payload/Applications/Server.app/Contents/ServerRoot/usr/share/man/man8/getsslpassphrase.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd Tue Nov 8 2011               \" DATE 
.Dt getsslpassphrase 8      \" Program name and manual section number 
.Os "macOS Server"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm getsslpassphrase
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Ar vhost:port [algorithm]  
.Sh DESCRIPTION          \" Section Header - required - don't modify
Used by Apache to extract pass phrases for certificates for SSL-enabled virtual hosts.
See the documentation of Apache's SSLPassPhraseDialog directive for detail.
The vhost and port arguments are required. The algorithm may also be specified as RSA or DSA but is ignored.
.sp
The
.Nm
tool attempts to extract the pass phrase for the specified virtual host from the system keychain
using the certadmin(8) tool. 
.sp
For certificate pass phrases in the system keychain, the tool will first try a specific match, and then
look for wild card certificates. Wild card certificates of the following form are supported:
 *.example.com, *.*.example.com, *.*.*.example.com, *.*.sub1.exampl.com, and *.sub2.sub1.example.com.
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "" -compact
.It Pa /var/log/getsslpassphrase.log
.El
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner 
