src/server/10.12/Payload/Applications/Server.app/Contents/ServerRoot/usr/share/man/man8/AssetCache.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 10/19/12               \" DATE 
.Dt AssetCache 8      \" Program name and manual section number 
.Os "macOS Server"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm AssetCache
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" .Nm Other_name_for_same_program(),
.\" .Nm Yet another name for the same program.
.\" Use .Nm macro to designate other names for the documented program.
.Nd Caching service
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl c Ar URL
.Op Fl l Ar level
.Op Fl p Ar number
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
speeds up the download of software and content distributed by Apple by
locally caching assets that were previously downloaded on your network.
.Nm
is typically controlled via the Server application.
.Pp
The following options are available:
.Bl -tag -width ".Cm --loglevel level" -compact
.It Fl c Ar URL
.It Cm --config Ar URL
Retrieve the configuration parameters from
.Ar URL
rather than the built-in default.  Only http and https URLs are
supported.
.Pp
.It Fl l Ar level
.It Cm --loglevel Ar level
Write messages at the specified
.Ar level
and above to the log file.  Log levels are:
.Ar error ,
.Ar warning ,
.Ar info ,
.Ar verbose ,
or
.Ar off .
.Pp
.It Fl p Ar number
.It Cm --port Ar number
Listen for download requests on TCP port
.Ar number
rather than the default randomly-chosen available port.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width -compact
.It Pa /Library/Server/Caching/Config/Config.plist
Configuration preferences.  Distinct from the configuration parameters
retrieved from Apple by the
.Fl c Ar URL
option.
.It Pa /Library/Server/Caching/Logs/Debug.log
Log file.
.El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr serveradmin 8
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
