src/server/10.14/Payload/Applications/Server.app/Contents/ServerRoot/usr/share/man/man8/certadmin.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 9/27/08               \" DATE 
.Dt certadmin 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm certadmin
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Mac OS X Server certificate administration helper tool
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
command              \" command
.Op command-arguments         \" [command-arguments] 
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is a tool that works with certificates managed by Mac OS X Server's administration
applications.
.Pp                      \" Inserts a space
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl -get-private-key-passphrase Ao Ar full-path Ac
Retrieve the passphrase from the keychain for the private key exported at the specified path 
.It Fl -export-directory
Retrieve the full path for the directory where the exported certificates and
keys are stored.
.It Fl -default-certificate-path
Retrieve the full path for the default certificate
.It Fl -default-certificate-authority-chain-path
Retrieve the full path for the default certificate authority chain
.It Fl -default-private-key-path
Retrieve the full path for the default private key
.It Fl -default-concatenation-path
Retrieve the full path for the default certificate + private key concatenation
.El                      \" Ends the list
.Pp
.Sh RETURN VALUES
Exit status is 0 on success, non-zero on errors.
.Pp
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr serveradmin 8 , 
.Xr servermgrd 8
