src/server/10.9/Payload/Applications/Server.app/Contents/ServerRoot/usr/share/man/man8/apspd.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 8/1/12               \" DATE 
.Dt apspd 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm apspd
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd ApplePushServiceProvider helper process
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is used by the ApplePushServiceProvider framework for various functions.
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/Library/Server/apspd.sqlite  " -compact
.It Pa /Library/Server/apspd.sqlite
Push Notification persistent store
.El                      \" Ends the list
.Sh NOTE
.Nm
should not be invoked directly.  It is intended only for use by the ApplePushServiceProvider framework.
.\".Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.\".Xr a 1 , 
.\".Xr b 1 ,
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
