src/server/10.9/Payload/Applications/Server.app/Contents/ServerRoot/usr/share/man/man8/Rooms.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 1/11/10               \" DATE 
.Dt Rooms 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm Rooms
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd XMPP component that provides Multi-User Chat service.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl vD              \" [-vD]
.Op Fl c Ar path         \" [-c path] 
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is an XMPP component providing XEP-0045 Multi-User Chat service.
The executable is normally not intended to be launched manually.
.Pp
A list of flags and their descriptions:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl c                 \"-a flag as a list item
Path to the service configuration file
.It Fl D
Execute in Debug mode
.It Fl v
Show version string
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El